Revit 2024 API
FabricLapSplicePosition Enumeration
 Fabric lap splice position in the fabric distribution
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum FabricLapSplicePosition
Visual Basic
Public Enumeration FabricLapSplicePosition
Visual C++
public enum class FabricLapSplicePosition
Members
Member name | Description
Aligned |  The fabric sheets are aligned.
MajorHalfwayStagger |  Every second fabric sheet is shifted half way in major direction.
MajorPassingStagger |  Every second fabric sheet is shifted half way and reversed in major direction.
MinorHalfwayStagger |  Every second fabric sheet is shifted half way in minor direction.
MinorPassingStagger |  Every second fabric sheet is shifted half way and reversed in minor direction.
See Also
Autodesk.Revit.DB.Structure Namespace